Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 一直很好说话的少年，第一次主动打断少女的言语，“救你的是陆道长，宁姑娘，所以你不用觉得亏欠什么，我如果当时不是觉得自己死定了，想着能够让陆道长为我爹娘多做点，否则我根本就不会开门。”
en_us: The agreeable young boy interrupted her for the first time, saying, "Ning Yao, it was Daoist Lu who saved you, so you don't need to feel like you owe me anything. If I hadn't thought that I was going to die at the time, and if I hadn't wanted to ask Daoist Lu to do a little something for my parents, I definitely wouldn't have opened the door."

source: 一直打量四周景象的苻南华随意打趣道：“在我们老龙城的井坊间，有个流传很广的说法，叫左眼跳财右眼跳灾，你是左眼跳还是右眼跳？”
en_us: Fu Nanhua had been surveying the surrounding area this entire time, and he casually jibed, "There's a popular superstition on the streets of our Old Dragon City, which states that the twitching of the left eyelid signified wealth, while the twitching of the right eyelid entailed disaster. Which eyelid is twtiching for you?"

source: 一直把话憋在肚子里的少年，终于忍不住了，轻声打断齐静春的言语，双手握拳，充满渴望和期待，“先生，其实我想问的问题，是我爹娘他们到底是怎么样的人”
en_us: The young boy finally couldn't hold in his words anymore, softly interrupting Qi Jingchun's explanation. He clasped his hands in respect and asked with an eager and yearning expression, "Mr. Qi, I acutally wanted to ask you about my parents. What kind of people were they?"

source: 一直死死盯住马苦玄右手动静陈平安，不再直线前冲，刹那之间就就折向右边。
en_us: Chen Ping'an had been staring at Ma Kuxuan's right hand the entire time, and he decided not to continue in a straight line anymore, instead leaning toward the right.

source: 一直被小镇百姓喊作先生的齐静春，在想着自己的先生。
en_us: As someone who was viewed as a teacher by the residents of the small town, Qi Jingchun was thinking about his own teacher at this moment.

source: 一直被蒙在鼓里的刘羡阳火急火燎道：“陈平安，你疯了吧，为啥把钱给她？整整两袋子铜钱，够你花多久了？”
en_us: Liu Xianyang, who had been kept in the dark this entire time, frantically exclaimed, "Chen Ping'an, have you gone mad? Why are you giving the coins to her? That's two entire bags of copper coins! Just how long would they last you?"

source: 一直面无表情的少年，突然露出惊骇眼神和恐慌脸色，视线直勾勾望向苻南华身后方向，仿佛是那个死了的高挑女子，活了过来。
en_us: Chen Ping'an's face had been completely devoid of expression this entire time, but all of a sudden, a look of shock and horror appeared on his face as he stared past Fu Nanhua, as if Cai Jinjian had suddenly returned from the dead.

source: 一线排开，悬停于高空。
en_us: All of the swords were arranged in a line, hovering high up in the sky, resembling a formidable army of cavaliers that could be let loose at any instant with a single command.

source: 一老一小缓缓走向那口铁锁井，小家伙，是个还挂着两条鼻涕虫的孩子，可是说起这个故事来，口齿清晰，有条不紊，根本不像是个才蒙学半年的乡野小娃娃，此时孩子正仰起头，大大的眼睛，像两颗黑葡萄，轻轻抽了抽鼻子，两条鼻涕小蛇就缩回去，孩子望着那个一手托着大白碗的说书先生，努努嘴，说道：“我说完了，你也该给我看看你碗里装着啥了吧？”
en_us: An old man and a small child were slowly making their way toward the Iron Lock Well. The child was still very young, with two lines of snot trailing out of his nostrils, but he could tell a very coherent and organized story, completely unlike the average rural child who had only been attending school for half a year. At this moment, the child was looking up with a pair of large eyes that resembled black grapes, and with a gentle sniffle, the two lines of snot retreated back into his nostrils. The child was looking at the storyteller who was carrying the large white bowl, and he said, "That's the end of my story. You're going to show me what's in your bowl now, right?"

source: 一脚踹向少女。
en_us: He then launched a kick at the young girl.

source: 一臂之距，即是一拳之距。
en_us: A distance of one arm was a distance of one punch.

source: 一行人沿着那条无名小溪往上游走，陈平安背着一只竹片泛黄的大背篓，陈松风则背着一只色泽依旧碧绿可爱的竹编书箱。刘灞桥很好奇陈平安背篓里到底装了什么，非要一探究竟，就让陈平安放慢脚步，他一边跟着一边在背篓里翻来翻去，发现乱七八糟的东西还不少，三盏叠放在一起的斗笠，两把壶，一把水壶，一把装油，大小两把柴刀，两块打火石和一捆火折子，背篓底部，还有一排被对半剖开后合拢的竹筒，约莫有七八截，一只装有鱼钩鱼线的小布袋。
en_us: The five people followed the nameless small creek upstream. Chen Ping'an was carrying a large and yellowed bamboo basket, while Chen Songfeng was carrying an adorable green bamboo bookcase. Liu Baqiao was extremely curious about what Chen Ping'an was carrying in his bamboo basket, and he insisted on investigating it no matter what. Thus, he told Chen Ping'an to stop, and he started rifling through the basket. However, he discovered that it was filled with random items. There were three bamboo hats stacked together, two flasks — one with water and one with oil — a large machete and a small machete, two flintstones, and a bundle of firewood. At the bottom of the basket, there was also a row of around seven or eight bamboo tubes that had been split in half and put back together again. Apart from this, there was also a small cloth pouch with fishing line and hooks.

source: 一袭墨绿长袍的少女以刀拄地，傲然道：“说不定到时候我就提着老猿的头颅，去你那边。”
en_us: The young girl in green leaned on her saber and said in a proud voice, "Perhaps I'll be waiting for you with the old ape's head in my hand at that time."

source: 一袭青衫的高大男人接过信封后，温声说道：“以后无事的时候，你可以多来这里旁听。”
en_us: The man accepted the letter, then encouraged in a warm voice, "If you have some free time, you can come here and listen to my lessons."

source: 一袭鲜艳红袍的男孩，咬牙切齿，死死盯住女孩，脸色阴森，但是也没有什么撂狠话，最后反而展颜一笑，很是灿烂。
en_us: The boy gritted his teeth tightly as he glowered at the girl with a sinister expression, but he didn't issue a retort. Instead, he suddenly put on a vibrant smile, as if he were completely unfazed by her mockery.

source: 一说到姚老头，刘羡阳就有些感伤：“姚老头这辈子就没说过几句好话，丧气话，晦气话，骂人的话，倒是一箩筐一箩筐的。”
en_us: Liu Xianyang felt slightly sad at the mention of Old Man Yao, and he said, "Old Man Yao barely ever said anything nice. However, he spoke basketfuls of demoralizing words, unlucky words, and curse words..."

source: 一起走出很远后，齐静春停下脚步，笑道：“我就不送了。”
en_us: After accompanying them for a long time, Qi Jingchun stopped and said with a smile, "I'll see you off here."

source: 一路上险象环生，若非那柄飞剑得了“气冲斗牛”匾额的其中两字，剑气与神意同时暴涨，并且与少女心有灵犀，能够心意所至，剑尖所指，长剑本身就像是一个不讲规矩的存在，这才使得老猿雷霆万钧的攻势次次被阻挠，帮助主人在毫厘之间侥幸逃生。
en_us: Her situation remained precarious, and if it wasn't for her flying sword receiving two characters from the plaque "unmatched aura", allowing it to grow explosively in Sword Qi and spirit, she would have faced many more life-threatening situations. Now, however, the flying sword was linked to Ning Yao's mind, and this allowed her to control it with her thoughts. It was because of this that she was able to block many of the old ape's vicious attacks.

source: 一路上，陈平安脑海中都是拳谱第一式的图画。
en_us: As Chen Ping'an ran to the creek, the only thing on his mind was the first stance of the fist technique.

source: 一路厮杀，老猿之所以没能擒拿下少女，除了飞剑捣乱之外，再就是少女所学很杂，剑修、武夫、炼气士，三者兼备，气息精纯且悠长。老猿实在想不透东宝瓶洲哪家宗门，能调教出这么个稀奇古怪的晚辈，所以出手愈发小心试探，想要确定其根脚来历。
en_us: After chasing Ning Yao for so long, Bai Yuan was unable to capture her partly because of the flying sword, and partly because she had practiced so many different arts. She practiced the sword art, martial arts, and also cultivation. Bai Yuan wracked his brains, but he truly couldn't think of a sect in the Eastern Treasured Vial Continent who could raise such a strange disciple. Thus, he became increasingly careful with his attacks as he attempted to ascertain her identity and background.

source: 一路打滚。
en_us: He continued to tumble along the ground.

source: 一路行来，一路见闻，一路感悟，宁姚的向道之心，始终稳若磐石，没有任何拖泥带水。
en_us: She walked vast stretches of road, she witnessed all kinds of different people and matters, she experienced a wide range of different comprehensions and enlightenments... However, Ning Yao's Dao Heart remained strong and unmoving. It wasn't soiled in the least.

source: 一身雪白的齐静春法相，只是扬起手臂，高高举起。
en_us: Qi Jingchun's Dao Manifestation merely kept his palm raised to ward off the attacks.

source: 一辆牛车缓缓驶出小镇，车上坐着一位有口皆碑的青衫读书郎，车夫是个神色木讷的中年汉子。
en_us: A cow-drawn cart slowly left the small town at this moment, carrying on it a reputable young student in azure. The cart driver was a middle-aged man with a prudent expression.

source: 一进一退，两人始终距离十余步。
en_us: With Fu Nanhua making his way toward Chen Ping'an, while the latter continued to back away, a gap of around a dozen meters was maintained between them.

source: 一道白虹从他脖子旁边擦过，剑锋带出一条不深的伤口。
en_us: A blade scraped past his neck, leaving a shallow wound.

source: 一道魁梧身影骤然间从溪水大石上激射向北岸，落在少女身前二十余步，盛气凌人。
en_us: A tall and burly figure suddenly leaped off a large rock in the creek and shot toward its northern banks, landing 20 or so steps away from the young girl. His aura was intense and domineering.

source: 一阵火大的少女快步走去，一脚就踩在四脚蛇脑袋上，脚尖狠狠拧动。
en_us: In a fit of fury, Zhi Gui quickly rushed over to the four-legged snake before stomping a foot down onto its head and grinding her foot viciously against the ground, causing the poor creature to screech in agony.

source: 一颗巨大如山峰的头颅，从云海中缓缓游曳而至。
en_us: A head that was as massive as a mountain slowly emerged from the clouds.

source: 一颗石子莫名其妙激射而至，重重砸在灵官神像高出头颅的那只拳头上，砸出许多碎屑下来。
en_us: A small stone mysteriously shot over, forcefully smashing into the raised fist of the Daoist Enforcer and causing several clay shards to rain down.

source: 一颗颗石子被老猿飞快挑出地面，最后在老猿手中以风雷滚动之势，激射而去。
en_us: One after another, Bai Yuan continued to flick stones into his hands before viciously throwing them at Ning Yao.

source: 三人一起走下廊桥台阶，陈平安轻声道：“我听齐先生说，刘羡阳没事了。”
en_us: The three of them walked down the stairs of the covered bridge, and Chen Ping'an said in a soft voice, "I heard Mr. Qi say that Liu Xianyang is doing okay now."

source: 三人回到衙署，那位观湖书院的儒家君子，崔明皇坐在在正厅等候已久，见到陌生女子后，崔明皇起身点头致意，女子也点了点头，脸色依然冰冷，用刘灞桥私底下的话说，就是一副“全天下都欠了她大把银子”的表情。
en_us: The trio returned to the kiln supervision official's office, and Cui Minghuang was seated in the main hall, having already been waiting for them for some time. Upon meeting the unfamiliar woman, Cui Minghuang rose to his feet and nodded to acknowledge, to which the woman also responded with a nod, but her expression remained as cold as ever. In the words of Liu Baqiao when talking about her behind her back, she looked as if everyone under the heavens owed her a large sum of silver.

source: 三人来到半山腰某处，陈平安指向不远处，一座小土包上生长有一棵树，主干古怪，极其之笔直，竟是比青竹还直，陈平安如释重负，点头道：“就是这里了。”
en_us: Upon reaching a certain point halfway up the mountain, Chen Ping'an pointed at a tree that was growing on a small mound not far away. The trunk of the tree was incredibly straight, even straighter than a bamboo tree, and Chen Ping'an was very relieved as he nodded and said, "This is the place."

source: 三十步外，溪畔青色石崖上，坐着个青衣少女，腮帮鼓鼓的，可她还在往嘴里塞东西。
en_us: Approximately 30 meters away, atop the green stone cliff, there sat a young girl in green whose cheeks were bulging with food. However, she still continued to stuff food into her mouth.

source: 三更半夜，万籁寂静。
en_us: In the silent depths of the night...

source: 三次过后，神人拔地而起，化作一道璀璨光柱离开此方天地。
en_us: After completing this ritual, the deity leaped up and transformed into a dazzling column of light that shot into the distance.

source: 三步，近在咫尺。
en_us: After these three large strides, the two young boys were almost face to face.

source: 三色闪电，唯独雪白闪电毫无征兆地静止不动，但是其余两种闪电依然遵循规矩而行，这就使得一条猩红闪电砰然撞断一条雪白闪电，一条青紫闪电又捆绑住猩红闪电。疏而不漏的天网恢恢，竟是变得混淆无序。
en_us: All of a sudden, the net of white lightning abruptly fell completely still without any warning, while the other two types of lightning were still moving as normal. As a result, the balance between the three types of lightning was disrupted, and a bolt of red lightning smashed through a bolt of white lightning, while a bolt of cyan lightning wound itself around a bolt of red lightning, plunging the entire system into complete chaos.

source: 三袋子金精铜钱，迎春钱，供养钱，压胜钱，很巧，刚好凑齐了。
en_us: Three pouches of gold essence copper coins — coincidentally, there was one pouch of Greeting Spring Coins, one pouch of Offering Coins, and one pouch of Good Fortune Coins. All three types of coins were present.

source: 三辆马车依次驶向泥瓶巷。
en_us: Three horse-drawn carriages trundled toward Clay Vase Alley.

source: 三辆马车驶过老槐树，驶出小镇，最后颠簸在泥泞不堪的道路上，一路往东。
en_us: The three carriages passed the old locust tree, exited the small town, and eventually made their way onto a muddy and uneven road. They continued to trundle toward the east.

source: 三辆马车，沿着仿佛没有尽头的山路一直向上。
en_us: Three horse-drawn carriages continued to trundle forward, advancing up the mountain road that seemingly had no end.

source: 三遍之后，陈平安已经略有好转，但是宁姚已经脸色阴沉得像要下yi场暴雨。
en_us: After three attempts, Chen Ping'an did indeed start to show some slight improvements. However, Ning Yao's expression was already as dark as thunderclouds that were about to unleash a wild storm.

source: 上五境修士，神龙见首不见尾，很难寻觅。但是武人当中的第八、第九境，往往天下皆知，与世俗王朝也离得不远。何况武道攀升，靠的就是一场场生死大战，于生死一线，见过生死，方能破开生死，获得一种类似佛家“自在”、道家“清净”的超然心境。
en_us: Cultivators of the Upper Five Tiers were exceedingly rare, but martial artists of the eighth or ninth tiers were often extremely well-known and closely related to various empires. On the path of martial arts cultivation, one could only progress through a series of battle of life and death. Only those who had witnessed life and death were able to transcend those concepts, attaining a transcendent state of mind, much like the state of nirvana in Buddhism or the state of tranquility in Daoism.

source: 下一刻，刚要碰到院门门栓的孩子一个踉跄，摔倒在地，但是等到他发现不对劲后，茫然四顾，最后抬起头，看着站在自己身边的说书先生，“这是哪儿？”
en_us: In the next instant, Gu Can was just about to reach the gate when he suddenly stumbled and fell to the ground. He immediately realized that something wasn't right, and he looked around with a dazed expression, then turned to the old storyteller as he asked, "What is this place?"

source: 下一刻，宋集薪瞪大眼睛，不知何时头顶的男人，已经落在福禄街上，与远处飞奔而来的魁梧老人，简简单单近乎蛮横地对撞而去。
en_us: In the next instant, Song Jixin's eyes widened with surprise. Before he knew it, Song Changjing had already descended onto Fortune Street, and he was charging directly at the oncoming Bai Yuan in a barbaric fashion.

source: 下一刻，少女整个人侧滑出去十数步。
en_us: In the next instant, her entire body was sent sliding over 10 meters to the side.

source: 下一刻，少女身体紧绷，杀意更重。
en_us: In the next instant, the young woman's body stiffened, and her killing intent became even more ferocious.

source: 下一刻，搬山猿突然双手离开那座山峰底面，一个侧滚，巨大身形压得附近树木倒塌无数。
en_us: The next instant, the hands of the Mountain-moving Ape suddenly retracted from underneath the gigantic mountain. At the same time, his colossal body rolled sideways, crushing a large swathe of nearby trees.

source: 下一刻，陈平安发现自己站在镜子一般的水面上，轻轻跺脚，能够踩出一圈圈涟漪，但是镜面并未塌陷。
en_us: Immediatley thereafter, he found himself standing on the surface of a mirror-like body of water. Ripples surged over the surface as he gently stomped his foot onto the water, but the surface didn't collapse.

source: 下一刻，陈平安如同一枝由强弓拉满激射而出的箭矢，瞬间来到马苦玄身前，速度之快，与之前相比，判若两人。
en_us: In the next moment, Chen Ping'an shot forward like an arrow released at full draw, instantly arriving before Ma Kuxuan. His speed was so quick that he seemed like a completely different person compared to just then.

source: 下一刻，齐静春元神出窍远游，如一身雪白衣袂飘飘的仙人，从躯壳牢笼当中瞬间挣脱开束缚，飘然去往小镇一条巷弄。
en_us: In the next instant, Qi Jingchun's soul left his body in the form of an immortal in flowing white robes, instantly freeing itself from the confines of his body as it drifted toward a certain alley in the town.

source: 下一幕景象，少年身上那股令人叹为观止的矫健灵活，得到了淋漓尽致的表现。
en_us: What came next was an incredible display of Chen Ping'an's agility and hand-eye coordination.

source: 下水之前，陈平安拔了许多溪畔春草垫在箩筐里，还唠叨说每捡二十块石头后，就要再垫些草。把刘羡阳烦得要把背后箩筐甩给陈平安，后者不答应，说换成自己背箩筐的话，按照刘羡阳那种毛躁性子，一定会直接丢石头进箩筐，他会心疼。刘羡阳差点当场就要撂挑子，这些个花花绿绿的石头，千百年来始终一文不值，怎么到了你陈平安这边就金贵娇气起来了？还敢嫌弃刘大爷的手法不够温柔？
en_us: Before entering the water, Chen Ping'an plucked some spring grass from the creekside and laid it on the bottom of his bamboo basket. He also said that he would need to put in a new layer for every 20 pebbles that they collected. Liu Xianyang was so annoyed that he was just about to toss the bamboo basket to Chen Ping'an. However, Chen Ping'an stopped him, saying that if he were to carry the basket instead, Liu Xianyang would definitely toss the pebbles into it in a careless manner, being such an impatient person and all. That would cause his heart to ache. Liu Xianyang was almost about to drop the basket and leave. These colorful pebbles had been worthless for hundreds upon thousands of years, yet when it came to Chen Ping'an, they were suddenly fragile and precious now? And Chen Ping'an even dared to complain about him not being gentle enough?

source: 不久之后陈平安捧出只小陶罐，两人锁好屋门院门，起走向泥瓶巷。到了陈平安院门口，看到他在那儿傻乎乎敲门，刘羡阳才知道原来这家伙，把家门钥匙全留给了黑衣少女，刘羡阳觉得这家伙是真无药可救了。
en_us: A short moment later, Chen Ping'an walked out with a small pot of soup. After locking the door, the two of them headed over to Clay Vase Alley. After arriving at Chen Ping'an's house, Liu Xianyang saw him stupidly standing there and knocking the gate. Only at this moment did he realize that Chen Ping'an had actually left his keys with Ning Yao. Liu Xianyang felt like this person couldn't be saved.

source: 不但如此，一阵阵弥漫天地间的春风，还不露痕迹地托住了下坠云海。
en_us: At the same time, gusts of spring breeze were sweeping through heaven and earth, arresting the downward momentum of the sea of clouds in a subtle manner.

source: 不凑巧，陈平安今天要送的十封信，几乎全是小镇出了名的阔绰户，这也很合情合理，龙生龙凤生凤，老鼠生儿打地洞，能够寄信回家的远方游子，家世肯定不差，否则也没那底气出门远行。其中九封信，陈平安其实就去了两个地方，福鹿街和桃叶巷，当他第一次踩在大如床板的青石板上，少年有些忐忑，放缓了脚步，竟然有些自惭形秽，忍不住觉得自己的草鞋脏了街面。
en_us: Coincidentally, almost all of the 10 letters that Chen Ping'an had been tasked with delivering were addressed to the renowned affluent clans in the town. However, this was quite a reasonable occurrence. As the saying went, the offspring of dragons and phoenixes were destined to soar in the heavens, while the offspring of mice could burrow in the dirt. Those who were traveling far away and able to send letters back to their families had to have come from privileged backgrounds. Otherwise, they wouldn't have had the courage and financial backing to go to such faraway places. For nine of the 10 letters, Chen Ping'an only had to go to two places, namely Fortune Deer Street and Peach Leaf Alley. The bluestone slabs that paved these streets were as large as bedsteads, and he felt rather uneasy as he stepped onto them for the first time. He unconsciously slowed down in his footsteps, and he was struck by a sense of inferiority, feeling as if he were soiling the ground with his straw sandals.

source: 不到一炷香的功夫，已经可以依稀听到溪水声，大步狂奔的少年非但没有停步，反而一个高高跃起，整个人坠入溪水当中，很快少年站起身，原来他落在了一块巨石之上，对这一块土地山水无比熟稔的少年，竭力睁大眼睛，凭借着过人的眼力和出众的记忆，在小溪当中的石头上跳跃，往下游方向一路流窜逃亡，如果一直这么下去，就能到达小镇南边的溪畔青牛背，然后是廊桥，最后则是阮师傅的铁匠铺。
en_us: A few more minutes passed, and at this point, he could already hear the faint sound of flowing water in the creek up ahead. Not only did he not stop or slow down here, he leaped high up into the air instead, plunging into the creek before quickly rising to his feet. As it turned out, he had landed on a huge rock. He was extremely familiar with this area, and he opened his eyes up as wide as they would go, using his exceptional eyesight and memory to skip from rock to rock in hte creek, fleeing toward the downstream direction. If he could continue down this path, then he would eventually reach the Azure Cow Ridge, which was situated to the south of the town. After that was the covered bridge, and after going beyond that, he would reach Master Ruan's forge.

source: 不到半个时辰，陈平安就已经摸出七八块石头，除了第一块颜色偏暗，其余石头皆是大且鲜艳。
en_us: In less than an hour, Chen Ping'an had already collected seven or eight snake gall pebbles. Apart from the first one appearing slightly duller, the rest of the pebbles were all large and brilliant.

source: 不去试试看，少年怎么都会不甘心，就像少年在铁匠铺那边，最后一次，求老掌柜一定要再试试看，是一样的道理。
en_us: He simply couldn't allow himself to give up as long as there was even a single stone that was left unturned. This was why he had repeatedly begged Shopkeeper Yang to save Liu Xianyang, even though the old shopkeeper had already given up.

source: 不可谓不处心积虑。
en_us: It had truly been a sinister and calculating scheme.

source: 不愧是yi位正人君子。
en_us: As expected of a noble and virtuous person.

source: 不愧是我们老宋家的种。
en_us: As expected of someone from the Song Clan.

source: 不料老猿长臂一抡而下的粗糙之势，变为五指灵巧握住刀锋，与此同时，另一只手则无比符合他本性本心，一把攥紧剑尖。
en_us: Surprisingly, however, Bai Yuan's fist opened up into a palm, and he nimbly grabbed the blade of her saber. Meanwhile, his other hand instictively shot over to grab the tip of her sword.

source: 不料草鞋少年竟然还是摇头。
en_us: To his surprise, Chen Ping'an shook his head once again.

source: 不料陈平安斩钉截铁道：“陆道长，送钱的话，很讲究，不俗气”
en_us: Chen Ping'an immediatley interjected, "It's not vulgar or tacky at all if you give me money, Daoist Lu. I'd be more than happy with that!"

source: 不明深意的陈平安只好一言不发，只是默然送他们这一行人离开院子。
en_us: Chen Ping'an didn't understand what she was trying to say, so he could only keep his mouth shut and remain silent as he watched them exit the courtyard.

source: 不是一字没有，而是有两个。
en_us: He had not one kindred character, but two.

source: 不是羡慕刘羡阳天赋高，力气大，人缘好。只是羡慕刘羡阳的天不怕地不怕，走到哪里都没心没肺，也从来不觉得独自活着，是什么糟糕的事情。刘羡阳不管到了什么地方，跟谁相处，很快就能够勾肩搭背，称兄道弟，喝酒划拳。刘羡阳因为他爷爷身体不好，很早就自力更生，成为孩子王一般的存在，捕蛇捉鱼掏鸟窝，无不娴熟，木弓鱼竿，弹弓捕鸟笼，刘羡阳好像什么都会做，尤其是在乡间田埂抓泥鳅和钓黄鳝这两件事，少年无疑是小镇上最厉害的。其实刘羡阳当年从乡塾退学的时候，那位齐先生还特意去找了刘羡阳病榻上的爷爷，说可以不收一钱，但是刘羡阳死活不答应，说他只想挣钱，不想读书，齐先生说他可以出钱雇佣刘阳羡当自己书童，刘羡阳依然不肯点头。事实上，刘羡阳活得挺好，哪怕姚老头死了，龙窑被封禁，没过几天他就被骑龙巷的铁匠相中，在小镇南边开始搭建茅屋、炉子，忙碌得很。
en_us: He didn't envy Liu Xianyang for his remarkable aptitude, strength, and charisma. Instead, he envied Liu Xianyang's fearlessness. No matter where he went, Liu Xianyang was never fazed by anything, nor did he ever feel like living alone was a bad thing. Wherever he went, he was always able to quickly make friends with whoever he met, getting on such friendly terms with them that they referred to one another as brothers and would drink and play drinking games together. Due to his grandfather's ill health, Liu Xianyang was forced to become self-dependent from a very young age, making him a leader of sorts among the children in the area. He was skilled at everything, whether it be catching snakes, fishing, procuring eggs from bird's nests, making bows, fishing rods, slingshots, bird cages... It seemed like there was nothing that he couldn't do. In particular, he was the undisputed king of the town when it came to catching catfish and fishing for eels in the channels of water running through plots of farmland. Back when Liu Xianyang dropped out of the private school, the teacher there, Mr. Xu, had paid a visit to Liu Xianyang's grandfather on his sickbed, offering to Liu Xianyang an education free of charge. However, Liu Xianyang refused to go back no matter what, telling the teacher that all he wanted to do was earn money, and that he had no interest in an education. Mr. Xu then offered Liu Xianyang a paid job as a scholarly attendant, but Liu Xianyang turned down that offer as well. As it turned out, Liu Xianyang was doing quite well for himself. Even though Old Man Yao had passed away and the dragon kilns had been shut down, it didn't take long before he caught the eye of the blacksmith from Dragon Rider Alley, and he was currently busy building his own forge in the southern part of the town.

source: 不曾想少年摇头道：“我前不久还是一口龙窑的学徒，在小镇外边住了很多年，刚搬来这儿，还不熟悉街坊邻居，你要不要问问别人？”
en_us: To his surprise, Chen Ping'an shook his head as he replied, "I was a disciple at a dragon kiln until just recently, so I was living outside the town for many years and only just moved back. Hence, I'm not very familiar with my neighbors on this alley. Perhaps you should ask someone else."

source: 不曾想老人已经自顾自给出了答案，“人丑。”
en_us: Unexpectedly, however, Old Man Yang answered for him, saying, "It's because you're ugly."

source: 不曾想老人脾气刚烈至极，直接顶回去一句，“我正阳山，开山两千六百年，有恩报恩，虽千年不忘，有怨报怨，从无过夜仇！”
en_us: However, the old man had an extremely unyielding personality, and he retorted, "Our Sun Scorch Mountain has been around for 2,600 years, and we've always repaid those who have treated us with kindness, but similarly, we've never spared anyone who's dared to wrong us!"

source: 不曾想陈对根本不听陈平安的解释，直接对陈松风说道：“你回小镇便是。”
en_us: Unexpectedly, however, Chen Dui completely ignored Chen Ping'an's advice. She looked at Chen Songfeng and directly said, "You can return to the small town."
